# print(14-7)
# print(18*9)
# print(14+1)
# print(24%8)
# print(21/4)
# #1
# print( )
# print('#1')
# ls_1 = [4, 15, 5]
# y = ls_1[0]
# print('Значение первой ячейки', y)
# #2
# print( )
# print('#2')
# ls_2 = [6, 16, 9, 11, 16]
# ls_2.append(15)
# y = ls_2[5]
# print('Значение в пятой ячейке =', y)
# #3
# print( )
# print('#3')
# ls_3 = [10, 18, 20, 22]
# y = len(ls_3)
# print('Кол. элементов в списке =', y)
# #4
# ls_4 = [7, 5, 16, 5, 1]
# print(ls_4)
# k = ls_4 + [3, 12, 9, 11, 14, 5]
# print('#4', 'Получившийся список =  ', k)
# #5
# ls_5 = [14, 18, 16, 19, 19]
# ls_5[3] = 14
# print('#5', ls_5)
# #6
# ls_6 = [11, 2, 4, 13]
# c = ls_6[2]
# print(c)
# #7
# ls_7 = [15, 18, 12, 12,13]
# v = 12 in ls_7
# print(v)
# #8
# ls_8 = [4, 5, 4, 2]
# ls_8.append(5)
# print(ls_8)
# #9
# print( )
# print('#9')
# ls_9 = [9, 4, 4, 15, 20]
# ls_9[2] = 18
# print(ls_9)
# print('Кол. символов.', len(ls_9))
#
# s = "vls not dead"
# a = 2
# w = s[a]
# print('символ #', a, 'это', w)
#
# #01
# s_1 = 'раздвинув басом ветра вой:'
# print(s_1)
# k = s_1.replace('ветра', 'ваш')
# print(k)
#02
# s_2 = 'ИЗ УЛИЦЫ В УЛИЦУ'
# w = s_2[9]
# print(w)
#03
# s_3 = 'а с запада падает красный снег'
# v = s_3[2]
# print(v)
# #4
# s_4 = 'как святыню, на руках понесут'
# h = 'хочет' in s_4
# f = 'на' in s_4
# print(h)
# print(f)
# #5
# s_5 = 'Морей неведомых далеким пляжем'
# r = s_5.split(' ')
# print(s_5)
# print(r)
# #6
s_6 = 'плыла, изгибаясь, дверями влекома;'
n = s_6.replace('плыла,', 'глаза.')
print(s_6)
print(n)
# #7
# s_7 = 'Ты зеленые весны идешь насиловать!'
# q = s_7[13]
# print(q)
# #8
# s_8 = 'Дай исцелую твою лысеющую голову'
# g = s_8[17:25]
# print(g)
# r = s_8.split(' ')
# print(r)
# print(r[3])
#
# d = {'a': 1, 'b': 2}
# print(d['a'])
# print(d)
# d['c'] = 5
# print(d)
# del d['b']
# print(d)
#
# #01
# d = {'a': 1, 'b': 3, 'c': 12}
# print(d)
# d['e'] = 17
# print('#1', d)
# #02
# d = {'a': 1, 'b': 3, 'c': 12}
# del d['b']
# print('#2', d)
# #03
# d = {'a': 1, 'b': 3, 'c': 12}
# print('#3', d)
# d['b'] = 20
# print('#3', d)
# #4
# d = {'a': 1, 'b': 3, 'c': 12}
# print('#4', d)
# print('#4 b=', d['b'])
# #5
# d = {'a': 1, 'b': 3, 'c': 12}
# d['d'] = 69
# print('#5', d)
# print('#5', d['d'])
# #6
# d = {'a': 1, 'b': 3, 'c': 12}
# del d['a']
# print('#6 Словарь', d)
# #7
# d = {'a': 1, 'b': 3, 'c': 12}
# print(d)
# d['b'] = 11
# print('#7', d)
# #8
# d = {'a': 1, 'b': 3, 'c': 12}
# print('#8 c=', d['c'])
# #9
# d = {'a': 1, 'b': 3, 'c': 12}
# print(d)
# d['d'] = 88
# print('#9', d)
#
# #условия  <>
#
# #1. Используя функцию > придумать:
#  # 3 примера когда результат будет равен True
#  #3 примера когда результат будет равен False
#
# print(3 > 2)
# print(9 > 8)
# print(96 > 69)
#
# print(2 > 3)
# print(2 > 17)
# print(2 > 30000000)
# print('')
# #2. Используя функцию < придумать:
# #  3 примера когда результат будет равен True
# #  3 примера когда результат будет равен False
#
# print(7 < 18)
# print(18 < 999)
# print(999 < 849842542985)
# print(99 < 88)
# print(999 < -4)
# print(99 < 88)
# print('')
# #3. Используя функцию == придумать:
# #  2 примера когда результат будет равен True
# #  2 примера когда результат будет равен False
#
# print(8 == 8)
# print(88 == 88)
# print(-89 == -89)
# print(8 == 78)
# print(958 == 88)
# print(-4 == -7)
# print('')
# #4. Используя функцию >= придумать:
# #  3 примера когда результат будет равен True
# #  3 примера когда результат будет равен False
#
# print(9 >= 4)
# print(9 >= 9)
# print(-8 >= -8)
# print(8 >= 14)
# print(-14 >= -8)
# print(-1 >= 0)
#
# #5. Используя функцию <= придумать:
# #  3 примера когда результат будет равен True
# #  3 примера когда результат будет равен False
#
# print(0 <= 1)
# print(0 <= 0)
#
# #Функция
# print('Функция AND')
# print(6 > 3 and 8 != 3)
# print(0 > -1 and -1 > -1000000)
# print(100 > 99 and 69 < 96)
# print(100 > 99 and 69 > 96)
# print(100 >= 99 and 69 >= 96)
# print(100 <= 99 and 69 > 96)
# print('')
# print('Функция OR')
# print(9 >= 5 or -1 >= -8)
# print(9 > 5 or 55 < 88)
# print(8 > 9 or  -1 < -88)
# print(88 < 5 or 17 > 89)
#
